def fibonacci(n):
    print(n)
    if n <= 1:
        return 1
    return fibonacci(n - 1) + fibonacci(n - 2)

fibonacci(5)
'''
---------------------------------
|                 5             |
---------------------------------
|       4         |       3     |
---------------------------------
      3   |   2   |   2   |  1  |
---------------------------------
  2   | 1 | 1 | 0 | 1 | 0 |
---------------------------
1 | 0 |
-------
Так сойдет за "проанализируйте стек вызовов для n = 5"? :)
'''